
## Plan Result (corpus-scheduler-lambda-cdk-production)

[CI link](https://github.com/Pocket/content-monorepo/actions/runs/17437747457)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.corpus-scheduler-sqs-lambda_F2ECDF9F


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.corpus-scheduler-sqs-lambda_F2ECDF9F will be updated in-place
  ~ resource "aws_lambda_function" "corpus-scheduler-sqs-lambda_F2ECDF9F" {
        id                             = "CorpusSchedulerLambda-Prod-SQS-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:CorpusSchedulerLambda-Prod-SQS-Function:248" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:CorpusSchedulerLambda-Prod-SQS-Function:248/invocations" -> (known after apply)
        tags                           = {
            "app_code"       = "content"
            "component_code" = "content-corpusschedulerlambda"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "service"        = "CorpusSchedulerLambda"
        }
      ~ version                        = "248" -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                          = (sensitive value)
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label corpus-scheduler-lambda-cdk-production/add-or-update: POST https://api.github.com/repos/Pocket/content-monorepo/issues/332/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":332,"Program":"tfcmt","SHA1":"1d50610f6769284413796a36642516da673a5cda","Target":"corpus-scheduler-lambda-cdk-production","Vars":{},"WorkflowName":"Corpus Scheduler Lambda"} -->